#include <string>
#include <iostream>
#include <vector>
#include <filesystem>
#include "lib/cd/cd.hpp"
#include "lib/runner/runner.hpp"


using namespace std;

	int main(){
		bool title_shown = false;
		while(true){
			

			if(title_shown == false){
				cout<<"██████╗  █████╗ ██████╗ ██████╗     ███████╗██╗  ██╗███████╗██╗     ██╗     "<<endl;
				cout<<"██╔══██╗██╔══██╗██╔══██╗██╔══██╗    ██╔════╝██║  ██║██╔════╝██║     ██║     "<<endl;
				cout<<"██║  ██║███████║██████╔╝██████╔╝    ███████╗███████║█████╗  ██║     ██║     "<<endl;
				cout<<"██║  ██║██╔══██║██╔══██╗██╔══██╗    ╚════██║██╔══██║██╔══╝  ██║     ██║     "<<endl;
				cout<<"██████╔╝██║  ██║██║  ██║██████╔╝    ███████║██║  ██║███████╗███████╗███████╗"<<endl;
				cout<<"╚═════╝ ╚═╝  ╚═╝╚═╝  ╚═╝╚═════╝     ╚══════╝╚═╝  ╚═╝╚══════╝╚══════╝╚══════╝"<<endl;
				title_shown = true;
			}

			cout<<"\033[30;46m\u2192["<<filesystem::current_path().string()<<"]\033[36;40m ";
			string input;
			getline(cin,input);
			
			vector<string> command = input_parser(input);

			if(command.empty()){
				cout<<endl;
			}else if (command[0] == "cd")
			{
				run_shell_command(command);
			}else if(input=="exit"){
				return 0;
			}else{
				run_command(command);
			}


		}
		return 0;
	}


